#Варіант 11

import random


print ('Виберіть варіант дій де: 1 - ввести дані самому , 2 - випадковий вибір')
a = int(input(''))

if a == 1:
    day = int(input('Введіть день тижня від 1 до 7 :'))
    weeks = {
        1: 'Понеділок (Робочий )',
        2: 'Вівторок (Робочий )',
        3: 'Середа (Робочий )',
        4: 'Четвер (Робочий )',
        5: "П'ятниця (Робочий )",
        6: 'Субота (Вихідний , але не завжди :) )',
        7: 'Неділя (Вихідний)',
    }
    print(weeks[day])
elif a == 2:
    day = random.randint(1, 7)
    weeks = {
        1: 'Понеділок (Робочий )',
        2: 'Вівторок (Робочий )',
        3: 'Середа (Робочий )',
        4: 'Четвер (Робочий )',
        5: "П'ятниця (Робочий )",
        6: 'Субота (Вихідний , але не завжди :) )',
        7: 'Неділя (Вихідний)',
    }
    print(weeks[day])
else:
    print('Введений не правильний варіант')